# Напишите программу, которая найдёт произведение пар чисел списка. Парой
# считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]


a = [2, 3, 4, 5, 6] 
res = []
for i in range(int(len(a) / 2) + len(a) % 2):
    res.append(a[i] * a[len(a) - i - 1])
print(res)

