# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных
#  индексов.
# Пример:- для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1,
#  1, 2, 3, 5, 8, 13, 21] [Негафибоначчи]

a = int(input("Введите число:"))
pos = [0, 1, 1]
neg = [1 , -1]
for i in range(a - 2):
    pos.append(pos[i + 1] + pos[i + 2])
    neg.append(neg[i] - neg[i + 1])
neg.reverse()
neg.extend(pos)
print(neg)